DELIMITER //
DROP PROCEDURE IF EXISTS InsertDisciplHasSpiv//

CREATE PROCEDURE InsertDisciplHasSpiv(IN _назва VARCHAR(150),
  IN _номерСеместру INT(10),
  IN _код INT(10),
  IN _Прізвище VARCHAR(100),
  IN _Імя varchar(45),
  IN _Побатькові VARCHAR(45),
  IN _ТрудовийСтаж TINYINT(4),
  IN _РікНародження TINYINT(4),
  IN _СеріяТаНомерПаспорту VARCHAR(150),
  IN _ПІБ VARCHAR(100),
  IN _співробітникиПрізвище VARCHAR(45),
  IN _співробітникиімя VARCHAR(45),
  IN _співробітникиПобатькові VARCHAR(45),
  IN _дисципліни_Назва VARCHAR(45))
  BEGIN
	insert into дисципліни(Назва,НомерСеместру,Код)
    values(_назва,_номерСеместру,_код);
    INSERT INTO співробітники (Прізвище, Імя, Побатькові, ТрудовийСтаж, РікНародження, СеріятТаНомерПаспорту, ПІБ)
    VALUES (_Прізвище, _Імя, _Побатькові, _ТрудовийСтаж, _РікНародження, _СеріяТаНомерПаспорту, _ПІБ);
    insert into співробітникидисципліни(співробітники_Прізвище,співробітники_імя,співробітники_Побатькові,дисципліни_Назва)
    values(_співробітникиПрізвище,_співробітникиімя,_співробітникиПобатькові,_дисципліни_Назва);
     SELECT * FROM співробітникидисципліни;
  END //
DELIMITER ;